{"vocab_size": 107008, "n_ctx": 2048, "n_positions": 2048, "n_embd": 6144, "n_layer": 34, "n_head": 24, "n_inner": null, "rotary_dim": 64, "activation_function": "gelu_new", "resid_pdrop": 0.0, "embd_pdrop": 0.0, "attn_pdrop": 0.0, "layer_norm_epsilon": 1e-05, "initializer_range": 0.02, "scale_attn_weights": true, "use_cache": true, "bos_token_id": 1, "eos_token_id": 106028, "return_dict": true, "output_hidden_states": false, "output_attentions": false, "torchscript": false, "torch_dtype": "float32", "use_bfloat16": false, "tf_legacy_loss": false, "pruned_heads": {}, "tie_word_embeddings": false, "is_encoder_decoder": false, "is_decoder": false, "cross_attention_hidden_size": null, "add_cross_attention": false, "tie_encoder_decoder": false, "max_length": 20, "min_length": 0, "do_sample": false, "early_stopping": false, "num_beams": 1, "num_beam_groups": 1, "diversity_penalty": 0.0, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "typical_p": 1.0, "repetition_penalty": 1.0, "length_penalty": 1.0, "no_repeat_ngram_size": 0, "encoder_no_repeat_ngram_size": 0, "bad_words_ids": null, "num_return_sequences": 1, "chunk_size_feed_forward": 0, "output_scores": false, "return_dict_in_generate": false, "forced_bos_token_id": null, "forced_eos_token_id": null, "remove_invalid_values": false, "exponential_decay_length_penalty": null, "suppress_tokens": null, "begin_suppress_tokens": null, "architectures": ["CodeGenForCausalLM"], "finetuning_task": null, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "tokenizer_class": "GPT2Tokenizer", "prefix": null, "pad_token_id": null, "sep_token_id": null, "decoder_start_token_id": null, "task_specific_params": {"text-generation": {"do_sample": true, "max_length": 50, "temperature": 1.0}}, "problem_type": null, "_name_or_path": "/remote-home/share/xyliu/sft/merged-25k-22k", "transformers_version": "4.25.1", "gradient_checkpointing": false, "model_type": "codegen", "summary_activation": null, "summary_first_dropout": 0.1, "summary_proj_to_labels": true, "summary_type": "cls_index", "summary_use_proj": true}